In [ ]:
import pandas as pd

# 01- How to find version

In [ ]:
# Check pandas version
pd.__version__

In [ ]:
# Another way to show pandas verison 
pd.show_versions()

 
# 02- Make a DataFrame

In [ ]:
df = pd.DataFrame({'Col A':[ 1,2,3], "Col B": [4,5,6]})
df

In [ ]:
# Array conversion to DataFrame
import numpy as np
array = np.array([[1,2,3], [4,5,6], [7,8,9]])
array

df = pd.DataFrame(array)
df

In [ ]:
# Creating a DataFrame with random floats 
df = pd.DataFrame(np.random.rand(4,8), columns=list('ABCDEFGH'))
df

# 03- How to rename a columns?

In [ ]:
# Creating a DataFrame with random integers and specific index and columns with names
df = pd.DataFrame(np.random.randint(1,11,size=(4,8))
                  ,columns=list("ABCDEFGH")
                  , index=['R1', 'R2', 'R3', 'R4'])
df

In [ ]:
df = pd.DataFrame(np.random.randint(1,21, size = (3,3)))
df

In [ ]:
# Change colums name
df.columns=['col1', 'col2','col3']
df

In [ ]:
# Change rows name
df.index=["Row-1", "Row-2", "Row-3"]
df

In [ ]:
# to replace any charactor or string
df.columns = df.columns.str.replace("-","_")

df

In [ ]:
# adding perfix in columns
df = df.add_prefix("A_")
df

In [ ]:
# adding suffix in columns
df = df.add_suffix("_X")
df

In [ ]:
df.columns=["col-1", "col-2", 'col-3']
df

# 04- Using tamplate data

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

In [ ]:
# summary
df.describe()

In [ ]:
# columns name
df.columns

In [ ]:
# rows count
df.index

In [ ]:
# save DataFrame to CSV
df.to_csv("zyx.csv")

In [ ]:
# converted to excel
df.to_excel("xyz.xlsx")
df.head(3)

# 05- Using your own data

In [ ]:
# read from excel
df = pd.read_csv("zyx.csv")
df

# 06- Reverse rows order

In [ ]:
import pandas as pd
import seaborn as sns

In [ ]:
df = sns.load_dataset("titanic")
df.head(3)

In [ ]:
# reverse order
df.loc[::-1].head()

In [ ]:
# reset index 
df.loc[::-1].reset_index(drop=True).head()

# 07- Reverse columns order

In [ ]:
df.loc[:, ::-1].head(3)

# 08- Select a colum by data type

In [ ]:
# select only numeric columns
df.select_dtypes(include=["number"]).head()

In [ ]:
# select only categoryical value
df.select_dtypes(include=['category']).head()

In [ ]:
# select only object type columns
df.select_dtypes(include='object').head()

In [ ]:
#select only Float64 type columns
df.select_dtypes(include='Float64').head()

In [ ]:
# select only number and category type columns
df.select_dtypes(include=['number', 'category']).head(3)

In [ ]:
# select all columns except number type
# This will include all non-numeric columns such as object, category, etc.
df.select_dtypes(exclude=['number']).head()

In [ ]:
# select all columns except category type
# This will include all non-category columns such as object, number, etc.
df.select_dtypes(exclude=['category']).head()

# 09- convert numaric into string

In [ ]:
#
df = pd.DataFrame({ "col_A" :[1,2,3,4,5],
                   'col_B' :[6,7,8,9,10]})
df.dtypes

In [ ]:
# Convert column 'col_A' to string type and 'col_B' to string type
df.astype({'col_A': 'str', "col_B": 'str'}).dtypes

In [ ]:
# Convert column 'col_A' to numeric type, coercing errors means that if there are any non-numeric values, they will be replaced with NaN
pd.to_numeric(df['col_A'],errors="coerce")

# 10- Reduce DataFrame size

In [ ]:
# reduce the DataFrame to a sample of 10% of its rows
df = sns.load_dataset('titanic')

df.sample(frac=0.1).shape
df.info()

# 11- copy DataFrame from clip board

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.to_excel("titanic_sample.xlsx", index=False)

In [ ]:
# read from clipboard
df = pd.read_clipboard()
df

# 12- Split dataframe in two subsets

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

In [ ]:
from random import random
df_1 = df.sample(frac=0.50, random_state=1 )
df_1.shape

In [ ]:
df_2 = df.drop(df_1.index)
df_2.shape

In [ ]:
df_1.head(4)

In [ ]:
df_2.head(4)

In [ ]:
df_1.shape

In [ ]:
df_2.shape

In [ ]:
len(df_2) + len(df_1)

# 13- Concat two datasets in one dataframe

In [ ]:
df = pd.concat([df_1, df_2])
df.shape

# 14- Filtering a dataframe

In [196]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [197]:
df.sex.unique()

array(['female', 'male'], dtype=object)

In [198]:
df[(df.sex=="male")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
623,0,3,male,21.0,0,0,7.8542,S,Third,man,True,NaN,Southampton,no,True
148,0,2,male,36.5,0,2,26.0000,S,Second,man,True,F,Southampton,no,False
34,0,1,male,28.0,1,0,82.1708,C,First,man,True,NaN,Cherbourg,no,False
794,0,3,male,25.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [199]:
df.who.unique()

array(['woman', 'man', 'child'], dtype=object)

In [205]:
df[(df.who=='child') & (df.age>14)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
111,0,3,female,14.5,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,no,False
830,1,3,female,15.0,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
352,0,3,male,15.0,1,1,7.2292,C,Third,child,False,NaN,Cherbourg,no,False
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
689,1,1,female,15.0,0,1,211.3375,S,First,child,False,B,Southampton,yes,False

In [216]:
df[(df.alive=='yes')].shape

(342, 15)

In [215]:
df[(df.alive=='no')].shape

(549, 15)

In [217]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [221]:
df[
    ( (df.embark_town == 'Southampton') ) |
    ( (df.embark_town == 'Queenstown') & (df.alone == "True") )
]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False
623,0,3,male,21.0,0,0,7.8542,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True